testdata/IN_2023_02/Roundtrip/produkt/rente/fpr/20190215_hochrechnung_ohne_dynamik_2023_02b.xml_request_2023_02b.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <tarif:getQuote xmlns:allg="http://www.bipro.net/namespace/allgemein" xmlns:basis="http://www.bipro.net/namespace/basis" xmlns:dt="http://www.bipro.net/namespace/datentypen" xmlns:gevo="http://www.bipro.net/namespace/gevo" xmlns:nachr="http://www.bipro.net/namespace/nachrichten" xmlns:partner="http://www.bipro.net/namespace/partner" xmlns:pm="http://www.bipro.net/namespace/produktmodell" xmlns:pm-leben="http://www.bipro.net/namespace/versicherung/produktmodell/leben" xmlns:tarif="http://www.bipro.net/namespace/versicherung/tarifierung" xmlns:vbl="urn:de:vb:bipro:taa:leben:1.12" xmlns:vs-pm="http://www.bipro.net/namespace/versicherung/produktmodell" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
        
      <tarif:Request>
            
        <nachr:BiPROVersion>2.4.6.1.9</nachr:BiPROVersion>
        <nachr:ConsumerID>WS DEV TEAM</nachr:ConsumerID>
            
        <tarif:Tarifierung>
                
          <gevo:Vermittler>
                    
            <allg:Vermittlernummer>111/222</allg:Vermittlernummer>
                  
          </gevo:Vermittler>
                
          <tarif:Partner xsi:type="partner:CT_Person">
                    
            <partner:PartnerID>1</partner:PartnerID>
                    
            <partner:Geburtsdatum>1992-11-01</partner:Geburtsdatum>
                    
            <partner:Geschlecht>1</partner:Geschlecht>
                  
          </tarif:Partner>
                
          <tarif:Verkaufsprodukt>
                    
            <pm:Produkt xsi:type="pm-leben:CT_Produkt">
                        
              <pm:Beitrag>
                            
                <pm:ArtID xsi:type="dt:STE_BeitragBasis">01</pm:ArtID>
                            
                <pm:Betrag>
                                
                  <allg:Betrag>200</allg:Betrag>
                                
                  <allg:Waehrung>EUR</allg:Waehrung>
                              
                </pm:Betrag>
                            
                <pm:Zahlungsweise>8</pm:Zahlungsweise>
                          
              </pm:Beitrag>
                        
              <pm:Versicherungsdauer>
                            
                <allg:Beginn>2023-03-01T12:00</allg:Beginn>
                 
          
              </pm:Versicherungsdauer>
                        
              <pm:Kennung>FPR</pm:Kennung>
                        
              <pm:Elementarprodukt xsi:type="pm-leben:CT_Rente">
                            
                <pm:Versicherungsdauer>
                                
                  <allg:AnzahlJahre>30</allg:AnzahlJahre>
                              
                </pm:Versicherungsdauer>
                            
                <pm:Dynamik>
                                
                  <pm:KategorieID>Beitrag</pm:KategorieID>
                              
                </pm:Dynamik>
                            
                <vs-pm:FondsPortfolio>
                                
                  <vs-pm:Portfoliobezeichnung xsi:type="vbl:STE_PortfoliobezeichnungRisikoErweitert">RisikoPortfolio2</vs-pm:Portfoliobezeichnung>
                                
                  <vs-pm:Phase>Aufschubphase</vs-pm:Phase>
                              
                </vs-pm:FondsPortfolio>
                            
                <pm-leben:Hochrechnungszins>7</pm-leben:Hochrechnungszins>
                            
                <pm-leben:IstHauptversicherung>true</pm-leben:IstHauptversicherung>
                            
                <pm-leben:VersichertePerson>
                                
                  <partner:PartnerID>1</partner:PartnerID>
                              
                </pm-leben:VersichertePerson>
                            
                <pm-leben:BeitragsRueckgewaehrBeiTod>01</pm-leben:BeitragsRueckgewaehrBeiTod>
                          
              </pm:Elementarprodukt>
                        
              <pm:Dynamik>
                            
                <pm:KategorieID>Beitrag</pm:KategorieID>
                            
                <pm:Hochrechnung>false</pm:Hochrechnung>
                          
              </pm:Dynamik>
                        
              <pm-leben:VorgabeBerechnung>
                            
                <pm-leben:ArtID xsi:type="dt:STE_VorgabeBerechnungBasis">Bruttobeitrag</pm-leben:ArtID>
                            
                <pm-leben:Kontext xsi:type="dt:STE_VorgabeBerechnungKontextBasis">Produkt</pm-leben:Kontext>
                          
              </pm-leben:VorgabeBerechnung>
                      
            </pm:Produkt>
                  
          </tarif:Verkaufsprodukt>
              
        </tarif:Tarifierung>
          
      </tarif:Request>
      
    </tarif:getQuote>
  </soapenv:Body>
</soapenv:Envelope>
